[
  {
    "images": [
      "http://edc.poolsupplyworld.com/wimages/product_image/swan.jpg",
      "http://edc.poolsupplyworld.com/wimages/product_image/psw-L90621-002.jpg",
      "http://edc.poolsupplyworld.com/wimages/product_image/psw-L90621-030.jpg"
    ],
    "description": "The Giant Swan is constructed of a heavy duty vinyl and measures a 75\" diameter. The combination of size and strength makes this float ideal for lounging or riding. The float has built-in handles on the head of the float for a secure ride. The Giant Swan Inflatable float is a fun and enjoyable addition to a day at the pool. Whether you want to relax or play, the Giant Swan is a great float that provides the best of both worlds.",
    "id": 270437,
    "type": "float",
    "name": "Swimline HUGE 75\" Rideable Swan Inflatable Float Pool L90621 FREE Vinyl Patch!",
    "brand": "Swimline"
  },
  {
    "images": [
      "http://edc.poolsupplyworld.com/wimages/product_image/supermaxvs.png"
    ],
    "description": "With its variable speed technology and premium features, the SuperMax VS Pool Pump is the perfect addition to your in ground swimming pool! Slash energy costs by up to 80% compared to standard pool pumps. Easy to program and operate, the SuperMax VS uses a 24-hour real time clock and easy to use interface that displays watts and RPMs. With this affordable variable speed pool pump, you won't need to spend a fortune to save on your utility bill. Suitable for new and standard pump replacement applications, this pump is ideal for in ground pool owners. This pump works with standard pools requiring up to 1-1/2HP pump. Save on monthly energy costs with the affordable, eco-friendly, and reliable SuperMax VS Variable Speed Pool Pump by Sta-Rite.",
    "aboveground": false,
    "id": 194517,
    "type": "pump",
    "name": "Variable Speed Energy Efficient Pool Pump, 230V",
    "brand": "Sta-Rite"
  },
  {
    "images": [
      "http://edc.poolsupplyworld.com/wimages/product_image/ultrasunsation-metallicblue.jpg",
      "http://edc.poolsupplyworld.com/wimages/product_image/ultrasunsation-live_57413.jpg"
    ],
    "description": "Offering you comfort and durability, the Super Soft Ultra Sunsation Foam Pool Float is a great way to relax in the sun. The Ultra Sunsation was designed for luxurious comfort and the ultimate buoyancy and support so it won't sink or deflate. Being designed with a closed-cell foam, this float won't absorb water. It's coated with a glossy vinyl to resist sun, chlorine, and salt water damage that makes it durable and easy to clean. Lounge around your pool in style and comfort with the superior Super Soft Ultra Sunsation Foamt Pool Float.",
    "id": 193903,
    "type": "float",
    "name": "Foam Pool Float,  2-1/2\" Thick, Metallic Blue",
    "brand": "Texas Recreation"
  },
  {
    "images": [
      "http://edc.poolsupplyworld.com/wimages/product_image/001_24956.jpg",
      "http://edc.poolsupplyworld.com/wimages/product_image/004_24956.jpg",
      "http://edc.poolsupplyworld.com/wimages/product_image/003_24956.jpg",
      "http://edc.poolsupplyworld.com/wimages/product_image/71225.jpg"
    ],
    "description": "The Oceania Pool Filter and Pump system is suitable for Intex above ground swimming pools that are soft-sided. This sand filter can filter up to 10,000 gallons of water and holds up to 42 pounds of sand. This filter comes with a top-mount valve that has four different positions for simple installation, virtually anywhere. The Oceania Pool Filter and Pump system includes the pump, filter tank, base, and a pressure gauge for easy installation. With an energy outlet of 115V, the Oceania Pool Filter and Pump system provides you with economical equipment that will keep your above ground pool running strong. If you want an equipment system for your soft-sided above ground pool that's effective and reliable choose the Oceania pool filter and pump system.",
    "aboveground": false,
    "id": 193392,
    "type": "pump",
    "name": "12\" Sand Filter Above Ground Pool System with 1/3HP Pump",
    "brand": "Oceania"
  },
  {
    "images": [
      "http://edc.poolsupplyworld.com/wimages/product_image/psw-BM1516-600-003.jpg",
      "http://edc.poolsupplyworld.com/wimages/product_image/psw-BM1516-600-011_41329.jpg"
    ],
    "description": "With the Gigantic Donut Pool Float by Big Mouth Toys you receive all the benefits of relaxing on a float while getting a kick out of floating on a giant donut. The Gigantic Donut Pool Float works great in any body of water. Lounge around on your favorite treat, with the Gigantic Donut by Big Mouth Toys.",
    "id": 184070,
    "type": "float",
    "name": "Big Mouth Gigantic Strawberry Donut Pool Float",
    "brand": "Big Mouth"
  },
  {
    "images": [
      "http://edc.poolsupplyworld.com/wimages/product_image/mx6_psw.jpg"
    ],
    "description": "With its innovative low-flow design, the Baracuda MX6 Suction Side Pool Cleaner consumes less energy while still boasting best in-class vacuum power to deliver a sparkling clean pool with less energy consumption.",
    "aboveground": false,
    "id": 148541,
    "type": "Cleaner",
    "name": "MX6 Suction Side Automatic Pool Cleaner",
    "brand": "Baracuda"
  },
  {
    "images": [
      "http://edc.poolsupplyworld.com/wimages/product_image/psw-500Y-011.jpg",
      "http://edc.poolsupplyworld.com/wimages/product_image/psw-500Y-017.jpg",
      "http://edc.poolsupplyworld.com/wimages/product_image/psw-500Y-014.jpg"
    ],
    "description": "The Aqua Critter by Hayward is a suction side pool cleaner meant to clean the bottom of your above ground swimming pool. This pool cleaner features quiet operation, a patented steering system, easy installation, and two hour cleaning cycles you'll love. Hayward's Aqua Critter Suction Side Pool Cleaner helps keep your pool clean and clear. It's patented steering system, quiet operation, and two hour cleaning cycles ensure that your pool is clear of dirt and debris. The Aqua Critter improves water circulation as it maneuvers around the pool increasing the efficiency of chemicals and filtration.",
    "aboveground": true,
    "id": 142608,
    "type": "cleaner",
    "name": "Aqua Critter Above Ground Suction Side Pool Cleaner",
    "brand": "Hayward"
  },
  {
    "images": [
      "http://edc.poolsupplyworld.com/wimages/product_image/13027-160-prodC_67416.jpg",
      "http://edc.poolsupplyworld.com/wimages/product_image/13027_160_prodB_67418.jpg",
      "http://edc.poolsupplyworld.com/wimages/product_image/13027_160_prodC_67419.jpg"
    ],
    "description": "The Spring Float takes the pool lounge to its bare basics. A 3\" diameter inflatable ring and pillow supports you as you float. The kit comes with a nylon bag with a sturdy handle for easy storage. When inflated the lounge opens up to a luxurious 66\"X40\".",
    "id": 141438,
    "type": "float",
    "name": "Swimways Spring Float",
    "brand": "Swimways"
  },
  {
    "images": [
      "http://edc.poolsupplyworld.com/wimages/product_image/52046000.jpg",
      "http://edc.poolsupplyworld.com/wimages/product_image/004_32258.jpg",
      "http://edc.poolsupplyworld.com/wimages/product_image/003_32258.jpg",
      "http://edc.poolsupplyworld.com/wimages/product_image/002_32258.jpg"
    ],
    "description": "The Patriot Suction Side Pool Cleaner is both an economical and automatic option in cleaning your above ground swimming pool of any size. The Patriot keeps pools sparkling clean while minimizing time spent on pool maintenance. Designed to clean any above ground pool with coving, flat bottom, or deep swimming areas, this suction side pool cleaner offers great features. The Patriot uses an octagon shaped, colorful foot pad and buoyancy ring that work together to keep the proper angle for effective pool cleaning. Its universal skimmer fitting allows this pool cleaner to adapt to most pool skimmers. Use the Patriot Suction Side Pool Cleaner to keep youre above ground swimming pool debris-free and sparkling clea",
    "aboveground": true,
    "id": 103799,
    "type": "cleaner",
    "name": "Splash 52046000 Patriot Suction Side Pool Cleaner",
    "brand": "Splash"
  }
]